# 595. 大的国家
# SQL架构
# 这里有张 World 表
#
# +-----------------+------------+------------+--------------+---------------+
# | name            | continent  | area       | population   | gdp           |
# +-----------------+------------+------------+--------------+---------------+
# | Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
# | Albania         | Europe     | 28748      | 2831741      | 12960000      |
# | Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
# | Andorra         | Europe     | 468        | 78115        | 3712000       |
# | Angola          | Africa     | 1246700    | 20609294     | 100990000     |
# +-----------------+------------+------------+--------------+---------------+
# 如果一个国家的面积超过300万平方公里，或者人口超过2500万，那么这个国家就是大国家。
#
# 编写一个SQL查询，输出表中所有大国家的名称、人口和面积。
#
# 例如，根据上表，我们应该输出:
#
# +--------------+-------------+--------------+
# | name         | population  | area         |
# +--------------+-------------+--------------+
# | Afghanistan  | 25500100    | 652230       |
# | Algeria      | 37100000    | 2381741      |
# +--------------+-------------+--------------+
SELECT
    name,population,area
FROM
    world
WHERE
        population > 25000000
   OR area > 3000000

# 596. 超过5名学生的课
# SQL架构
# 有一个courses 表 ，有: student (学生) 和 class (课程)。
#
# 请列出所有超过或等于5名学生的课。
#
# 例如,表:
#
# +---------+------------+
# | student | class      |
# +---------+------------+
# | A       | Math       |
# | B       | English    |
# | C       | Math       |
# | D       | Biology    |
# | E       | Math       |
# | F       | Computer   |
# | G       | Math       |
# | H       | Math       |
# | I       | Math       |
# +---------+------------+
# 应该输出:
#
# +---------+
# | class   |
# +---------+
# | Math    |
# +---------+
select class
from courses
group by class
having count(distinct student)>=5